WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/vendor_commands.c
/**
 * vendor_commands.c — DSPi STM32H723 vendor USB control request dispatch
 *
 * M7a: GET_PLATFORM stub.
 * M7b: + GET_ALL_PARAMS / SET_ALL_PARAMS bulk transfers, GET_STATUS.
 *      DSPi Console reads the entire DSP state in one shot via
 *      REQ_GET_ALL_PARAMS and populates its UI from that. SET_ALL_PARAMS
 *      writes back; the DSP-pipeline globals get the new values, but
 *      audio processing isn't wired up yet (M7c).
 *
 * Subsequent milestones (M7c–M7d) port the rest of the ~30 vendor
 * commands from firmware/DSPi/vendor_commands.c.
 */

#include <string.h>
#include <math.h>

#include "stm32h7xx_hal.h"   /* HAL_RCC_GetSysClockFreq for REQ_GET_STATUS w=13 */
#include "tusb.h"
#include "config.h"
#include "vendor_commands.h"
#include "bulk_params.h"
#include "dsp_pipeline.h"

#include "usb_audio.h"   /* update_master_volume, AudioState, channel_names */
#include "audio_input.h" /* INPUT_SOURCE_USB */
#include "notify.h"      /* notify_param_write — M7j */
#include <stddef.h>      /* offsetof */

extern uint8_t channel_band_counts[NUM_CHANNELS];
extern MatrixMixer matrix_mixer;
extern volatile float    global_preamp_db    [NUM_INPUT_CHANNELS];
extern volatile float    global_preamp_linear[NUM_INPUT_CHANNELS];
extern volatile int32_t  global_preamp_mul   [NUM_INPUT_CHANNELS];
extern volatile float    master_volume_db;
extern volatile SystemStatusPacket global_status;

extern volatile bool   bypass_master_eq;
extern volatile bool   loudness_enabled;
extern volatile float  loudness_ref_spl;
extern volatile float  loudness_intensity_pct;
extern volatile bool   loudness_recompute_pending;
#include "crossfeed.h"
extern volatile CrossfeedConfig crossfeed_config;
extern volatile bool            crossfeed_update_pending;
#include "leveller.h"
extern volatile LevellerConfig leveller_config;
extern volatile bool           leveller_update_pending;
extern volatile bool           leveller_reset_pending;
extern volatile float channel_gain_db    [3];
extern volatile float channel_gain_linear[3];
extern volatile int32_t channel_gain_mul [3];
extern volatile bool  channel_mute       [3];
extern float channel_delays_ms[NUM_CHANNELS];
extern int32_t channel_delay_samples[NUM_DELAY_CHANNELS];
extern bool    any_delay_active;
extern uint8_t output_types[NUM_SPDIF_INSTANCES];
extern uint8_t output_pins[NUM_PIN_OUTPUTS];
extern uint8_t  i2s_bck_pin;
extern uint8_t  i2s_mck_pin;
extern bool     i2s_mck_enabled;
extern uint16_t i2s_mck_multiplier;

static inline float db_to_linear(float db) {
    return powf(10.0f, db * 0.05f);
}

/* M7d helper: keep all three preamp views (db / linear / Q28 mul) in
 * sync. The DSP fill_half currently uses `_linear`; the others are
 * preserved so the bulk_params snapshot matches the RP build's wire
 * format. */
static void update_preamp_ch(uint8_t ch, float db) {
    if (ch >= NUM_INPUT_CHANNELS) return;
    if (db < -90.0f) db = -90.0f;
    if (db >  20.0f) db =  20.0f;
    float lin = db_to_linear(db);
    global_preamp_db    [ch] = db;
    global_preamp_linear[ch] = lin;
    global_preamp_mul   [ch] = (int32_t)(lin * (1 << 28));
}

/* Bulk SET payload buffer — sized for one WireBulkParams transfer.
 * tud_control_xfer chunks the actual EP0 transfers; the application
 * just provides one contiguous buffer of wLength bytes. */
/* bulk_param_buf is non-static — main.c drains it from the main loop after
 * REQ_SET_ALL_PARAMS deposits a full state via tud_control_xfer. */
uint8_t __attribute__((aligned(4))) bulk_param_buf[sizeof(WireBulkParams)];

/* Set on the SET-side ACK stage; the main loop checks and calls
 * bulk_params_apply() when true (M7c will hook the main loop into
 * this — for M7b we just record it and let the DSP-pipeline-less
 * code path effectively no-op the application). */
volatile bool bulk_params_pending = false;

/* Captured at SETUP so the DATA-stage handler knows what to do. */
static uint8_t  vendor_last_request = 0;
static uint16_t vendor_last_wValue  = 0;
static uint16_t vendor_last_wLength = 0;
static uint8_t  vendor_rx_buf[64];   /* Generic SET payload buffer (≤ EP0 size) */

bool tud_vendor_control_xfer_cb(uint8_t rhport,
                                uint8_t stage,
                                tusb_control_request_t const *req) {
    /* ---- SETUP stage ---- */
    if (stage == CONTROL_STAGE_SETUP) {
        bool const is_get = (req->bmRequestType & 0x80) != 0;

        if (is_get) {
            switch (req->bRequest) {
                case REQ_GET_PLATFORM: {
                    /* DSPi Console expects 4 bytes:
                     *   [0] platform ID
                     *   [1] FW major (BCD high byte)
                     *   [2] FW minor (high nibble) + patch (low nibble)
                     *   [3] NUM_OUTPUT_CHANNELS (informational)
                     * Returning fewer = short-read STALL = Console dies. */
                    static uint8_t resp[4] = {
                        (uint8_t)DSPI_PLATFORM,
                        (uint8_t)(FW_VERSION_BCD >> 8),
                        (uint8_t)(FW_VERSION_BCD & 0xFF),
                        (uint8_t)NUM_OUTPUT_CHANNELS,
                    };
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            resp, sizeof(resp));
                }
                case REQ_GET_ALL_PARAMS: {
                    bulk_params_collect((WireBulkParams *)bulk_param_buf);
                    uint16_t len = sizeof(WireBulkParams);
                    if (req->wLength < len) len = req->wLength;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            bulk_param_buf, len);
                }
                case REQ_GET_STATUS: {
                    /* Console polls wValue=9 for combined status:
                     *   NUM_CHANNELS×u16 peaks + cpu0 + cpu1 + u16 clip_flags
                     * = 11×2 + 1 + 1 + 2 = 26 bytes on STM32H723 (RP2350-shape).
                     * wValue=15 returns the current sample rate as u32. */
                    static uint8_t status_buf[NUM_CHANNELS * 2 + 4];
                    if (req->wValue == 9) {
                        for (int i = 0; i < NUM_CHANNELS; ++i) {
                            status_buf[i*2]     = global_status.peaks[i] & 0xFF;
                            status_buf[i*2 + 1] = global_status.peaks[i] >> 8;
                        }
                        status_buf[NUM_CHANNELS * 2]     = global_status.cpu0_load;
                        status_buf[NUM_CHANNELS * 2 + 1] = global_status.cpu1_load;
                        status_buf[NUM_CHANNELS * 2 + 2] = global_status.clip_flags & 0xFF;
                        status_buf[NUM_CHANNELS * 2 + 3] = global_status.clip_flags >> 8;
                        return tud_control_xfer(rhport,
                                                (tusb_control_request_t *)req,
                                                status_buf, sizeof(status_buf));
                    }
                    if (req->wValue == 15) {
                        static uint32_t rate;
                        rate = audio_state.freq;
                        return tud_control_xfer(rhport,
                                                (tusb_control_request_t *)req,
                                                &rate, 4);
                    }
                    /* M7g — system stats Console polls per-second:
                     *   13: SYSCLK (Hz) — 550 MHz on STM32H723 at VOS0
                     *   14: Vdda  (mV) — back-computed from VREFINT
                     *   16: Tj    (centi-°C) — internal temp sensor
                     */
                    if (req->wValue == 13) {
                        static uint32_t hz;
                        hz = HAL_RCC_GetSysClockFreq();
                        return tud_control_xfer(rhport,
                                                (tusb_control_request_t *)req,
                                                &hz, 4);
                    }
                    /* wValue=14 (Vdda mV) intentionally falls through to
                     * STALL — Console treats a failed request as "feature
                     * not supported" and hides the field. STM32H7's Vdda is
                     * pin-bonded to 3.3 V on this board, so a back-computed
                     * value adds noise without information. */
                    if (req->wValue == 16) {
                        extern int16_t read_temperature_cdeg(void);
                        static int32_t cdeg;
                        cdeg = (int32_t)read_temperature_cdeg();
                        return tud_control_xfer(rhport,
                                                (tusb_control_request_t *)req,
                                                &cdeg, 4);
                    }
                    return false;
                }
                case REQ_GET_PREAMP: {
                    /* Legacy single-value GET — returns channel 0's preamp. */
                    static float v;
                    v = global_preamp_db[0];
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_PREAMP_CH: {
                    uint8_t ch = req->wValue & 0xFF;
                    if (ch >= NUM_INPUT_CHANNELS) return false;
                    static float v;
                    v = global_preamp_db[ch];
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_MASTER_VOLUME: {
                    static float v;
                    v = master_volume_db;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_INPUT_SOURCE: {
                    /* USB-only on STM32 until M8 brings SPDIFRX. */
                    static uint8_t src = INPUT_SOURCE_USB;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &src, 1);
                }

                case REQ_GET_BYPASS: {
                    static uint8_t v;
                    v = bypass_master_eq ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_DELAY: {
                    uint8_t ch = req->wValue & 0xFF;
                    if (ch >= NUM_CHANNELS) return false;
                    static float v;
                    v = channel_delays_ms[ch];
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_CHANNEL_GAIN: {
                    uint8_t ch = req->wValue & 0xFF;
                    if (ch >= 3) return false;
                    static float v;
                    v = channel_gain_db[ch];
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_CHANNEL_MUTE: {
                    uint8_t ch = req->wValue & 0xFF;
                    if (ch >= 3) return false;
                    static uint8_t v;
                    v = channel_mute[ch] ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }

                case REQ_GET_LOUDNESS: {
                    static uint8_t v; v = loudness_enabled ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_LOUDNESS_REF: {
                    static float v; v = loudness_ref_spl;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_LOUDNESS_INTENSITY: {
                    static float v; v = loudness_intensity_pct;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }

                case REQ_GET_CROSSFEED: {
                    static uint8_t v; v = crossfeed_config.enabled ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_CROSSFEED_PRESET: {
                    static uint8_t v; v = crossfeed_config.preset;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_CROSSFEED_FREQ: {
                    static float v; v = crossfeed_config.custom_fc;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_CROSSFEED_FEED: {
                    static float v; v = crossfeed_config.custom_feed_db;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_CROSSFEED_ITD: {
                    static uint8_t v; v = crossfeed_config.itd_enabled ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }

                case REQ_GET_LEVELLER_ENABLE: {
                    static uint8_t v; v = leveller_config.enabled ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_LEVELLER_AMOUNT: {
                    static float v; v = leveller_config.amount;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_LEVELLER_SPEED: {
                    static uint8_t v; v = leveller_config.speed;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_LEVELLER_MAX_GAIN: {
                    static float v; v = leveller_config.max_gain_db;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_LEVELLER_LOOKAHEAD: {
                    static uint8_t v; v = leveller_config.lookahead ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_LEVELLER_GATE: {
                    static float v; v = leveller_config.gate_threshold_db;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case 0xFE: {  /* DEBUG: dump delay-stage internal state */
                    static struct __attribute__((packed)) {
                        int32_t  ds0;       /* channel_delay_samples[0]   */
                        int32_t  ds1;       /* channel_delay_samples[1]   */
                        uint8_t  active;    /* any_delay_active           */
                        uint8_t  pad[3];
                        uint32_t freq;      /* audio_state.freq           */
                        float    ms_out0;   /* channel_delays_ms[CH_OUT_1]*/
                        float    ms_out1;   /* channel_delays_ms[CH_OUT_2]*/
                    } d;
                    d.ds0     = channel_delay_samples[0];
                    d.ds1     = channel_delay_samples[1];
                    d.active  = any_delay_active ? 1 : 0;
                    d.freq    = audio_state.freq;
                    d.ms_out0 = channel_delays_ms[CH_OUT_1];
                    d.ms_out1 = channel_delays_ms[CH_OUT_2];
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            &d, sizeof(d));
                }

                case REQ_GET_MATRIX_ROUTE: {
                    uint8_t in_  = (req->wValue >> 8) & 0xFF;
                    uint8_t out  =  req->wValue       & 0xFF;
                    if (in_ >= NUM_INPUT_CHANNELS || out >= NUM_OUTPUT_CHANNELS)
                        return false;
                    static MatrixRoutePacket pkt;
                    MatrixCrosspoint *xp = &matrix_mixer.crosspoints[in_][out];
                    pkt.input = in_; pkt.output = out;
                    pkt.enabled = xp->enabled;
                    pkt.phase_invert = xp->phase_invert;
                    pkt.gain_db = xp->gain_db;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            &pkt, sizeof(pkt));
                }
                case REQ_GET_OUTPUT_ENABLE: {
                    uint8_t out = (uint8_t)req->wValue;
                    if (out >= NUM_OUTPUT_CHANNELS) return false;
                    static uint8_t v;
                    v = matrix_mixer.outputs[out].enabled;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_OUTPUT_GAIN: {
                    uint8_t out = (uint8_t)req->wValue;
                    if (out >= NUM_OUTPUT_CHANNELS) return false;
                    static float v;
                    v = matrix_mixer.outputs[out].gain_db;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_OUTPUT_MUTE: {
                    uint8_t out = (uint8_t)req->wValue;
                    if (out >= NUM_OUTPUT_CHANNELS) return false;
                    static uint8_t v;
                    v = matrix_mixer.outputs[out].mute;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_OUTPUT_DELAY: {
                    uint8_t out = (uint8_t)req->wValue;
                    if (out >= NUM_OUTPUT_CHANNELS) return false;
                    static float v;
                    v = matrix_mixer.outputs[out].delay_ms;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }

                case REQ_GET_CHANNEL_NAME: {
                    uint8_t ch = req->wValue & 0xFF;
                    if (ch >= NUM_CHANNELS) return false;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            channel_names[ch], PRESET_NAME_LEN);
                }
                case REQ_GET_OUTPUT_TYPE: {
                    uint8_t slot = (uint8_t)req->wValue;
                    if (slot >= NUM_SPDIF_INSTANCES) return false;
                    static uint8_t v;
                    v = output_types[slot];
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }

                /* ---- I2S clock / pin config (Console probes these) ---- */
                case REQ_GET_I2S_BCK_PIN: {
                    static uint8_t v; v = i2s_bck_pin;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_MCK_ENABLE: {
                    static uint8_t v; v = i2s_mck_enabled ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_MCK_PIN: {
                    static uint8_t v; v = i2s_mck_pin;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_MCK_MULTIPLIER: {
                    static uint16_t v; v = i2s_mck_multiplier;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 2);
                }

                /* ---- Per-output pin (SPDIF/PDM GPIO assignments) ---- */
                case REQ_GET_OUTPUT_PIN: {
                    uint8_t out = (uint8_t)req->wValue;
                    if (out >= NUM_PIN_OUTPUTS) return false;
                    static uint8_t v; v = output_pins[out];
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }

                /* ---- Identification ---- */
                case REQ_GET_SERIAL: {
                    /* M7g — 16-byte ASCII hex serial derived from the H7's
                     * 96-bit unique device ID at 0x1FF1E800. We encode the
                     * low 64 bits (8 bytes) as 16 hex chars — uniqueness is
                     * already guaranteed by the factory programming. The
                     * full 96-bit ID would need 24 chars, more than the
                     * Console's 16-byte buffer; the upper 32 bits are
                     * mostly wafer/lot info and rarely change between
                     * adjacent dies, so dropping them costs ~no entropy in
                     * practice. */
                    static uint8_t serial[16];
                    static int     serial_built = 0;
                    if (!serial_built) {
                        const uint32_t *uid = (const uint32_t *)0x1FF1E800UL;
                        uint64_t lo64 = ((uint64_t)uid[1] << 32) | uid[0];
                        static const char hex[] = "0123456789ABCDEF";
                        for (int i = 0; i < 16; ++i) {
                            int shift = (15 - i) * 4;
                            serial[i] = hex[(lo64 >> shift) & 0xF];
                        }
                        serial_built = 1;
                    }
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            serial, sizeof(serial));
                }

                /* ---- Core 1 mode (no Core 1 on H723) ---- */
                case REQ_GET_CORE1_MODE: {
                    static uint8_t v = 0; /* CORE1_MODE_IDLE — no second core */
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_CORE1_CONFLICT: {
                    /* No conflicts — single core handles everything. */
                    static uint8_t v = 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }

