WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/vendor_commands.c
                /* ---- Master volume mode (independent / per-preset) ---- */
                case REQ_GET_MASTER_VOLUME_MODE: {
                    static uint8_t v = 0; /* MASTER_VOLUME_MODE_INDEPENDENT */
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }

                /* ---- SPDIF RX pin (no SPDIF RX in M7d) ---- */
                case REQ_GET_SPDIF_RX_PIN: {
                    static uint8_t v = 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }

                /* ---- Preset directory: empty (no preset storage in M7d) ----
                 *
                 *   [0-1] occupied bitmask u16 = 0  (no slots filled)
                 *   [2]   startup_mode = 0         (no auto-load)
                 *   [3]   default_slot = 0
                 *   [4]   last_active = 0
                 *   [5]   include_pins = 0
                 *   [6]   master_volume_mode = 0
                 */
                case REQ_PRESET_GET_DIR: {
                    static uint8_t dir[7] = { 0 };
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            dir, sizeof(dir));
                }
                case REQ_PRESET_GET_ACTIVE: {
                    static uint8_t v = 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_PRESET_GET_STARTUP: {
                    static uint8_t v[3] = { 0, 0, 0 };
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            v, sizeof(v));
                }
                case REQ_PRESET_GET_INCLUDE_PINS: {
                    static uint8_t v = 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_PRESET_GET_NAME: {
                    /* All slots empty — return zero-filled name. */
                    static char nm[32] = { 0 };
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            nm, sizeof(nm));
                }

                /* ---- Clear clips ---- */
                case REQ_CLEAR_CLIPS: {
                    static uint16_t f;
                    f = global_status.clip_flags;
                    global_status.clip_flags = 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &f, 2);
                }
                case REQ_GET_EQ_PARAM: {
                    /* wValue encodes (channel<<8) | (band<<4) | param.
                     *   param: 0=type, 1=freq(f32), 2=Q(f32), 3=gain_db(f32), 4=bypass */
                    uint8_t channel = (req->wValue >> 8) & 0xFF;
                    uint8_t band    = (req->wValue >> 4) & 0x0F;
                    uint8_t param   =  req->wValue       & 0x0F;
                    if (channel >= NUM_CHANNELS
                        || band >= channel_band_counts[channel]) return false;
                    static uint32_t resp;
                    EqParamPacket *p = &filter_recipes[channel][band];
                    switch (param) {
                        case 0: resp = (uint32_t)p->type; break;
                        case 1: memcpy(&resp, &p->freq,    4); break;
                        case 2: memcpy(&resp, &p->Q,       4); break;
                        case 3: memcpy(&resp, &p->gain_db, 4); break;
                        case 4: resp = (p->bypass == 1) ? 1u : 0u; break;
                        default: return false;
                    }
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            &resp, 4);
                }
                case REQ_GET_BAND_BYPASS: {
                    /* wValue = (channel<<8) | band — payload 1 byte. */
                    uint8_t ch   = (req->wValue >> 8) & 0xFF;
                    uint8_t band =  req->wValue       & 0xFF;
                    if (ch >= NUM_CHANNELS
                        || band >= channel_band_counts[ch]) return false;
                    static uint8_t v;
                    v = (filter_recipes[ch][band].bypass == 1) ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            &v, 1);
                }
                default:
                    return false;
            }
        }

        /* SET path — record context, set up DATA-stage receive. */
        vendor_last_request = req->bRequest;
        vendor_last_wValue  = req->wValue;
        vendor_last_wLength = req->wLength;

        if (req->bRequest == REQ_SET_ALL_PARAMS
            && req->wLength == sizeof(WireBulkParams)) {
            return tud_control_xfer(rhport,
                                    (tusb_control_request_t *)req,
                                    bulk_param_buf, req->wLength);
        }

        if (req->wLength == 0) {
            /* Zero-length SET — ack immediately. */
            return tud_control_status(rhport, (tusb_control_request_t *)req);
        }

        /* All other small SETs land in vendor_rx_buf for the DATA-stage
         * dispatcher to consume. */
        if (req->wLength <= sizeof(vendor_rx_buf)) {
            return tud_control_xfer(rhport,
                                    (tusb_control_request_t *)req,
                                    vendor_rx_buf, req->wLength);
        }

